Repository: Unixcision/uniconnect
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, km, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# settings.search.alias.setting.app.default-terminal
source: app.defaultTerminal default terminal ssh links command tool unix executable launch services handler
ja: app.defaultTerminal default terminal ssh links command tool unix executable launch services handler デフォルトターミナル SSH リンク 実行ファイル

# settings.search.alias.setting.app.workspace-inherit-working-directory
source: app.workspaceInheritWorkingDirectory workspace cwd directory inherit current focused ghostty working-directory
ja: app.workspaceInheritWorkingDirectory workspace cwd directory inherit current focused ghostty working-directory 作業ディレクトリ 継承 現在 フォーカス Ghostty

# settings.search.alias.setting.app.supported-file-previews
source: app.openSupportedFilesInCmux cmd click file preview pdf image video audio quicklook quick look editor external
ja: app.openSupportedFilesInCmux cmd click file preview pdf image video audio quicklook quick look editor external ファイルプレビュー PDF 画像 動画 音声 エディタ 外部

# settings.search.alias.setting.app.warn-before-closing-tab
source: app.warnBeforeClosingTab close tab confirmation command-w cmd-w terminal surface
ja: app.warnBeforeClosingTab close tab confirmation command-w cmd-w terminal surface タブを閉じる 確認 警告

# settings.search.alias.setting.app.show-workspace-description
source: sidebar.showWorkspaceDescription workspace description notes markdown sidebar
ja: sidebar.showWorkspaceDescription workspace description notes markdown sidebar ワークスペース 説明 メモ マークダウン サイドバー

# settings.search.alias.setting.terminal.tab-bar-font-size
source: surface-tab-bar-font-size tab bar font size text scale terminal browser pane tab title
ja: surface-tab-bar-font-size tab bar font size text scale terminal browser pane tab title タブバー フォントサイズ テキスト 拡大 ターミナル ブラウザ ペーン タブ タイトル

# settings.search.alias.setting.sidebarAppearance.font-size
source: sidebar-font-size sidebar font size text scale workspace title badge metadata shortcut hint
ja: sidebar-font-size sidebar font size text scale workspace title badge metadata shortcut hint サイドバー フォントサイズ テキスト 拡大 ワークスペース タイトル バッジ メタデータ ショートカット ヒント

# settings.search.alias.setting.automation.ripgrep-path
source: automation.ripgrepBinaryPath ripgrep rg binary executable path search find nix custom
ja: automation.ripgrepBinaryPath ripgrep rg binary executable path search find nix custom 検索 パス カスタム
ko: automation.ripgrepBinaryPath ripgrep rg binary executable path search find nix custom 검색 경로 사용자 지정

# settings.search.alias.setting.browser.hidden-webview-discard
source: browser.discardHiddenWebViews memory hidden tabs webview discard unload reclaim
ja: browser.discardHiddenWebViews memory hidden tabs webview discard unload reclaim メモリ 非表示 タブ 破棄 解放 復元 ブラウザ

# settings.search.alias.setting.browser.hidden-webview-discard-delay
source: browser.hiddenWebViewDiscardDelaySeconds memory hidden tabs delay seconds discard unload
ja: browser.hiddenWebViewDiscardDelaySeconds memory hidden tabs delay seconds discard unload メモリ 非表示 タブ 遅延 秒 破棄 解放

# settings.search.prompt
source: Search
ja: 検索

# settings.search.noResults
source: No Results
ja: 結果なし

# settings.workspaceColors.customEntry
source: Named palette entry.
ja: 名前付きのパレット項目です。
ko: 이름이 지정된 팔레트 항목.

# settings.workspaceColors.resetPalette.subtitleV2
source: Restore the built-in palette and remove extra named colors.
ja: 組み込みパレットを復元し、追加した名前付きカラーを削除します。
ko: 기본 팔레트를 복원하고 추가된 이름 있는 색상을 제거합니다.

# shortcut.toggleUnread.label
source: Toggle Unread
ja: 未読を切り替え

# shortcut.markOldestUnreadAndJumpNext.label
source: Mark as Oldest Unread and Jump to Next Latest Unread
ja: 最古の未読としてマークして次の最新未読にジャンプ

# shortcut.focusHistoryBack.label
source: Focus Back
ja: フォーカスを戻す

# shortcut.focusHistoryForward.label
source: Focus Forward
ja: フォーカスを進める

# shortcut.key.space
source: Space
ja: スペース

# shortcut.unbound.displayValue
source: None
ja: なし

# shortcut.recorder.clear
source: Unbind
ja: 割り当て解除

# shortcut.recorder.clear.help
source: Unbind shortcut
ja: ショートカットの割り当てを解除

# shortcut.recorder.restore
source: Restore
ja: 復元

# shortcut.recorder.restore.help
source: Restore previous shortcut
ja: 前のショートカットを復元

# shortcut.recorder.error.bareKeyNotAllowed
source: Shortcuts must include ⌘ ⌥ ⌃ or ⇧
ja: ショートカットには ⌘ ⌥ ⌃ または ⇧ を含める必要があります

# shortcut.recorder.error.conflictsWithAction
source: This shortcut conflicts with %@ (%@).
ja: このショートカットは %@（%@）と競合しています。

# shortcut.recorder.error.conflictsWithAction.swap
source: This shortcut conflicts with %@ (%@). Swap shortcuts?
ja: このショートカットは %@（%@）と競合しています。ショートカットを入れ替えますか？

# shortcut.recorder.error.numberedShortcutRequiresDigit
source: Use a digit from 1 through 9.
ja: 1 から 9 の数字を使ってください。

# shortcut.recorder.error.reservedBySystem
source: This keystroke is reserved by macOS.
ja: このキー入力は macOS によって予約されています。

# shortcut.recorder.error.systemWideHotkeyRequiresModifier
source: System-wide hotkeys must include Command, Option, or Control.
ja: システム全体のホットキーには Command、Option、または Control を含める必要があります。

# shortcut.recorder.swap
source: Swap
ja: 入れ替え

# shortcut.recorder.undo
source: Undo
ja: 元に戻す

# shortcut.key.mediaBrightnessDown
source: Brightness Down
ja: 画面の明るさを下げる

# shortcut.key.mediaBrightnessUp
source: Brightness Up
ja: 画面の明るさを上げる

# shortcut.key.mediaMute
source: Mute
ja: 消音

# shortcut.key.mediaNext
source: Next Track
ja: 次のトラック

# shortcut.key.mediaPlayPause
source: Play/Pause
ja: 再生/一時停止

# shortcut.key.mediaPrevious
source: Previous Track
ja: 前のトラック

# shortcut.key.mediaVolumeDown
source: Volume Down
ja: 音量を下げる

# shortcut.key.mediaVolumeUp
source: Volume Up
ja: 音量を上げる

# shortcut.reopenPreviousSession.label
source: Restore Previous App Launch
ja: 前回のアプリ起動を復元

# shortcut.toggleReactGrab.label
source: Toggle React Grab
ja: React Grabの切り替え
ko: React Grab 전환
zh_hans: 切换 React Grab
zh_hant: 切換 React Grab

# fileExplorer.empty
source: No folder open
ja: フォルダが開かれていません
ko: 열린 폴더 없음

# fileExplorer.contextMenu.copyPath
source: Copy Path
ja: パスをコピー

# fileExplorer.contextMenu.copyRelativePath
source: Copy Relative Path
ja: 相対パスをコピー

# fileExplorer.contextMenu.insertPath
source: Insert Path
ja: パスを挿入

# fileExplorer.contextMenu.insertRelativePath
source: Insert Relative Path
ja: 相対パスを挿入

# fileExplorer.contextMenu.openDefault
source: Open in Default Editor
ja: デフォルトのエディタで開く

# fileExplorer.contextMenu.revealInFinder
source: Reveal in Finder
ja: Finderで表示

# fileExplorer.error.unavailable
source: File explorer is not available
ja: ファイルエクスプローラーは利用できません
ko: 파일 탐색기를 사용할 수 없습니다

# fileExplorer.error.sshFailed
source: SSH command failed
ja: SSH コマンドに失敗しました
ko: SSH 명령에 실패했습니다

# fileExplorer.status.sshHomeFailed
source: Unable to resolve SSH home: %@
ja: SSH のホームを解決できません: %@

# fileExplorer.status.sshResolvingHome
source: Resolving remote home...
ja: リモートのホームを解決中...

# fileExplorer.status.sshUnavailable
source: SSH files unavailable
ja: SSH ファイルを利用できません

# fileExplorer.status.sshUnavailableWithDetail
source: SSH files unavailable: %@
ja: SSH ファイルを利用できません: %@

# fileExplorer.search.empty
source: Type to search
ja: 入力して検索

# fileExplorer.search.failed
source: Search failed: %@
ja: 検索に失敗しました: %@

# fileExplorer.search.limit
source: First %d matches
ja: 最初の%d件

# fileExplorer.search.matches
source: %d matches
ja: %d件

# fileExplorer.search.noMatches
source: No matches
ja: 一致なし

# fileExplorer.search.placeholder
source: Search files
ja: ファイルを検索

# fileExplorer.search.rgExited
source: rg exited with status %d
ja: rg がステータス %d で終了しました

# fileExplorer.search.rgNotInstalled
source: ripgrep (rg) is not installed or is not on PATH.
ja: ripgrep (rg) がインストールされていないか、PATH にありません。

# fileExplorer.search.searching
source: %d matches, searching
ja: %d件、検索中

# fileExplorer.search.rgConfiguredPathNotExecutable
source: Configured ripgrep path is not executable: %@
ja: 設定されたripgrepパスは実行できません: %@
ko: 설정된 ripgrep 경로를 실행할 수 없습니다: %@

# fileExplorer.search.unsupported
source: Local folders only
ja: ローカルフォルダのみ

# titlebar.fileExplorer.accessibilityLabel
source: Toggle File Explorer
ja: ファイルエクスプローラーを切替
ko: 파일 탐색기 토글

# titlebar.fileExplorer.tooltip
source: Show or hide the file explorer
ja: ファイルエクスプローラーの表示/非表示
ko: 파일 탐색기 표시 또는 숨기기

# sidebar.pinnedWorkspaceProtected.tooltip
source: Pinned workspace. Closing requires confirmation.
ja: ピン留めされたワークスペースです。閉じるには確認が必要です。
ko: 고정된 워크스페이스입니다. 닫으려면 확인이 필요합니다.
uk: Закріплена робоча область. Закриття потребує підтвердження.

# sidebar.port.openTooltip
source: Open localhost:%lld
ja: localhost:%lldを開く
ko: localhost:%lld 열기
uk: Відкрити localhost:%lld

# remote.status.connected
source: Connected
ja: 接続済み
ko: 연결됨
uk: Підключено

# remote.status.connecting
source: Connecting
ja: 接続中
ko: 연결 중
uk: Підключення

# remote.status.reconnecting
source: Reconnecting
ja: 再接続中
ko: 다시 연결 중
uk: Повторне підключення

# remote.status.error
source: Error
ja: エラー
ko: 오류
uk: Помилка

# sidebar.remote.subtitleFallback
source: SSH workspace
ja: SSH ワークスペース
ko: SSH 워크스페이스
uk: SSH робоча область

# sidebar.remote.help.connected
source: SSH connected to %@
ja: SSH は %@ に接続済み
ko: %@에 SSH 연결됨
uk: SSH підключено до %@

# sidebar.remote.help.connecting
source: SSH connecting to %@
ja: SSH は %@ に接続中
ko: %@에 SSH 연결 중
uk: SSH підключення до %@

# sidebar.remote.help.reconnecting
source: SSH reconnecting to %@
ja: SSH は %@ に再接続中
ko: %@에 SSH 다시 연결 중
uk: SSH повторно підключається до %@

# sidebar.remote.help.error
source: SSH error for %@
ja: %@ の SSH エラー
ko: %@에 대한 SSH 오류
uk: Помилка SSH для %@

# sidebar.remote.help.errorWithDetail
source: SSH error for %@: %@
ja: %@ の SSH エラー: %@
ko: %@에 대한 SSH 오류: %@
uk: Помилка SSH для %@: %@

# sidebar.remote.help.disconnected
source: SSH disconnected from %@
ja: SSH は %@ から切断済み
ko: %@에서 SSH 연결 해제됨
uk: SSH відключено від %@

# sidebar.remote.help.targetFallback
source: remote host
ja: リモートホスト
ko: 원격 호스트
uk: віддалений хост

# sidebar.activeTabIndicator.leftRail
source: Left Rail
ja: 左レール
ko: 왼쪽 레일
uk: Лівий рейл

# sidebar.activeTabIndicator.solidFill
source: Solid Fill
ja: 塗りつぶし
ko: 단색 채우기
uk: Суцільне заповнення

# socket.surfaceSplitOff.error.appDelegateUnavailable
source: AppDelegate not available
ja: AppDelegateを利用できません

# socket.surfaceSplitOff.error.invalidDirection
source: Missing or invalid direction (left|right|up|down)
ja: 方向が指定されていないか無効です（left|right|up|down）

# socket.surfaceSplitOff.error.invalidWindowId
source: Missing or invalid window_id
ja: window_idが指定されていないか無効です

# socket.surfaceSplitOff.error.invalidWorkspaceId
source: Missing or invalid workspace_id
ja: workspace_idが指定されていないか無効です

# socket.surfaceSplitOff.error.missingSurfaceId
source: Missing or invalid surface_id
ja: surface_idが指定されていないか無効です

# socket.surfaceSplitOff.error.moveSurfaceFailed
source: Failed to move surface
ja: サーフェスを移動できませんでした

# socket.surfaceSplitOff.error.sourcePaneNotFound
source: Source pane not found
ja: 移動元ペインが見つかりません

# socket.surfaceSplitOff.error.splitPaneFailed
source: Failed to split pane
ja: ペインを分割できませんでした

# socket.surfaceSplitOff.error.surfaceNotFound
source: Surface not found
ja: サーフェスが見つかりません

# socket.surfaceSplitOff.error.surfaceNotFoundInWindow
source: Surface not found in window
ja: ウィンドウ内にサーフェスが見つかりません

# socket.surfaceSplitOff.error.surfaceNotFoundInWorkspace
source: Surface not found in workspace
ja: ワークスペース内にサーフェスが見つかりません

# socket.surfaceSplitOff.error.wouldEmptySourcePane
source: splitting off would leave the source pane empty
ja: 分割して移動すると移動元ペインが空になります

# update.error.failed.message
source: Something went wrong while checking for updates. Try again, or check the update log for details.
ja: アップデートの確認中に問題が発生しました。もう一度お試しいただくか、アップデートログをご確認ください。

# update.error.notReady
source: Updater is still starting. Try again in a moment.
ja: アップデーターを準備中です。しばらくしてからもう一度お試しください。

# workspace.closeProtected.message
source: Pinned workspaces can't be closed while pinned. Unpin the workspace first.
ja: ピン留めされたワークスペースは閉じられません。先にピンを外してください。
ko: 고정된 워크스페이스는 고정된 상태에서 닫을 수 없습니다. 먼저 워크스페이스의 고정을 해제하세요.
uk: Закріплені робочі області не можна закрити, поки вони закріплені. Спочатку відкріпіть робочу область.

# filePreview.openExternally
source: Open Externally
ja: 外部アプリで開く

# filePreview.openInApplication
source: Open in %@
ja: %@で開く

# filePreview.openWith.menu
source: Open With
ja: このアプリケーションで開く

# markdown.copyConfirm.html
source: Copied as HTML
ja: HTMLとしてコピーしました

# markdown.copyConfirm.markdown
source: Copied as Markdown
ja: Markdownとしてコピーしました

# markdown.fileUnavailable.message
source: The file may have been moved or deleted.
ja: ファイルが移動または削除された可能性があります。
ko: 파일이 이동되었거나 삭제되었을 수 있습니다.
uk: Можливо, файл було переміщено або видалено.

# markdown.fileUnavailable.title
source: File unavailable
ja: ファイルを利用できません
ko: 파일을 사용할 수 없음
uk: Файл недоступний

# markdown.mode.preview
source: Preview
ja: プレビュー

# markdown.mode.showPreview
source: Show Preview
ja: プレビューを表示

# markdown.mode.showTextEdit
source: Show TextEdit
ja: テキスト編集を表示

# markdown.mode.text
source: TextEdit
ja: テキスト編集

# markdown.mode.toggle
source: Toggle Markdown Mode
ja: Markdownモードを切り替え

# markdown.toolbar.copyHTML
source: Copy as HTML
ja: HTMLとしてコピー

# markdown.toolbar.copyMarkdown
source: Copy as Markdown
ja: Markdownとしてコピー

# markdown.toolbar.revert
source: Revert
ja: 元に戻す

# markdown.toolbar.save
source: Save
ja: 保存

# markdown.web.remoteImageBlocked
source: Remote image blocked
ja: リモート画像をブロックしました

# markdown.web.remoteImageConsentMessage
source: UniConnect will not contact this image URL until you load this image.
ja: この画像を読み込むまで、UniConnect はこの画像 URL に接続しません。

# markdown.web.remoteImageLoadImage
source: Load this image
ja: この画像を読み込む

# markdown.web.remoteImageLoading
source: Loading
ja: 読み込み中

# markdown.web.remoteImageHTTPSOnly
source: Only HTTPS remote images can be loaded in the viewer.
ja: ビューアー内で読み込めるのは HTTPS のリモート画像のみです。

# markdown.web.remoteImageCopyURL
source: Copy image URL
ja: 画像 URL をコピー

# markdown.web.remoteImageCopied
source: Copied
ja: コピーしました

# markdown.web.remoteImageOpenURL
source: Open image URL
ja: 画像 URL を開く

# markdown.web.remoteImageNotAllowed
source: This remote image URL cannot be loaded in the viewer.
ja: このリモート画像 URL はビューアー内で読み込めません。

# markdown.web.remoteImageURL
source: Image URL: {url}
ja: 画像 URL: {url}

# settings.sidebarAppearance.fontSize
source: Sidebar Font Size
ja: サイドバーのフォントサイズ

# settings.sidebarAppearance.fontSize.reset
source: Reset
ja: リセット

# settings.sidebarAppearance.fontSize.saveFailed
source: Couldn't save sidebar font size. Please try again.
ja: サイドバーのフォントサイズを保存できませんでした。もう一度お試しください。

# settings.sidebarAppearance.fontSize.subtitle
source: Controls workspace titles, metadata, badges, and shortcut hints in the left sidebar.
ja: 左サイドバーのワークスペースタイトル、メタデータ、バッジ、ショートカットヒントのサイズを調整します。

# settings.sidebarAppearance.matchTerminalBackground
source: Match Terminal Background
ja: ターミナルの背景に合わせる

# settings.sidebarAppearance.matchTerminalBackground.subtitle
source: Use the same background color and transparency as the terminal.
ja: ターミナルと同じ背景色と透明度を使用します。

# error.remoteDrop.invalidFileURL
source: Dropped item is not a file URL.
ja: ドロップされた項目はファイル URL ではありません。
ko: 드롭한 항목이 파일 URL이 아닙니다.
uk: Перетягнутий елемент не є файловою URL-адресою.

# error.remoteDrop.unavailable
source: Remote drop is unavailable.
ja: リモートへのドロップは利用できません。
ko: 원격 드롭을 사용할 수 없습니다.
uk: Віддалене перетягування недоступне.

# error.remoteDrop.uploadFailed
source: Failed to upload dropped file: %@
ja: ドロップされたファイルのアップロードに失敗しました: %@
ko: 드롭한 파일을 업로드하지 못했습니다: %@
uk: Не вдалося завантажити перетягнутий файл: %@

# terminalContextMenu.copyIdentifiers
source: Copy IDs
ja: IDをコピー
ko: ID 복사

# terminalContextMenu.moveTab
source: Move Tab
ja: タブを移動
ko: 탭 이동

# terminalContextMenu.moveTabToNewWorkspace
source: Move Tab to New Workspace
ja: タブを新規ワークスペースに移動
ko: 탭을 새 작업 공간으로 이동

# terminalContextMenu.splitHorizontally
source: Split Horizontally
ja: 水平に分割
ko: 가로 분할

# terminalContextMenu.splitVertically
source: Split Vertically
ja: 垂直に分割
ko: 세로 분할

# terminalContextMenu.triggerFlash
source: Trigger Flash
ja: フラッシュを発火
ko: 플래시 실행

# shortcut.editWorkspaceDescription.label
source: Edit Workspace Description
ja: ワークスペースの説明を編集
ko: 워크스페이스 설명 편집

# shortcut.focusRightSidebar.label
source: Toggle Right Sidebar Focus
ja: 右サイドバーのフォーカスを切替
ko: 오른쪽 사이드바 포커스 전환

# shortcut.switchRightSidebarToFiles.label
source: Show Sidebar Files
ja: サイドバーのファイルを表示
ko: 사이드바 파일 표시

# shortcut.switchRightSidebarToFind.label
source: Show Sidebar Find
ja: サイドバーの検索を表示

# shortcut.switchRightSidebarToSessions.label
source: Show Sidebar Vault
ja: サイドバーのボールトを表示
ko: 사이드바 볼트 표시

# shortcut.switchRightSidebarToFeed.label
source: Show Sidebar Feed
ja: サイドバーのフィードを表示
ko: 사이드바 피드 표시

# shortcut.switchRightSidebarToDock.label
source: Show Sidebar Dock
ja: サイドバーのDockを表示
ko: 사이드바 Dock 표시

# menu.view.focusRightSidebar
source: Toggle Right Sidebar Focus
ja: 右サイドバーのフォーカスを切替
ko: 오른쪽 사이드바 포커스 전환

# menu.view.editWorkspaceDescription
source: Edit Workspace Description…
ja: ワークスペースの説明を編集…
ko: 워크스페이스 설명 편집…

# command.editWorkspaceDescription.title
source: Edit Workspace Description…
ja: ワークスペースの説明を編集…
ko: 워크스페이스 설명 편집…

# command.clearWorkspaceDescription.title
source: Clear Workspace Description
ja: ワークスペースの説明を消去
ko: 워크스페이스 설명 지우기

# commandPalette.description.workspacePlaceholder
source: Workspace description
ja: ワークスペースの説明
ko: 워크스페이스 설명

# commandPalette.description.workspaceInputHint
source: Press Enter to save. Press Shift-Enter for a new line, or Escape to cancel.
ja: Enter で保存します。Shift-Enter で改行、Escape でキャンセルします。
ko: Enter를 눌러 저장하세요. Shift-Enter로 줄바꿈, Escape로 취소합니다.

# contextMenu.editWorkspaceDescription
source: Edit Workspace Description…
ja: ワークスペースの説明を編集…
ko: 워크스페이스 설명 편집…

# contextMenu.clearWorkspaceDescription
source: Clear Workspace Description
ja: ワークスペースの説明を消去
ko: 워크스페이스 설명 지우기

# contextMenu.showWorkspaceInFinder
source: Show in Finder
ja: Finderで表示

# settings.section.terminal
source: Terminal
ja: ターミナル

# settings.terminal.tabBarFontSize
source: Tab Bar Font Size
ja: タブバーのフォントサイズ

# settings.terminal.tabBarFontSize.reset
source: Reset
ja: リセット

# settings.terminal.tabBarFontSize.saveFailed
source: Couldn't save tab bar font size. Please try again.
ja: タブバーのフォントサイズを保存できませんでした。もう一度お試しください。

# settings.terminal.tabBarFontSize.subtitle
source: Controls the font size of the terminal and browser tab titles at the top of each pane.
ja: 各ペーン上部のターミナルとブラウザのタブタイトルのフォントサイズを調整します。

# settings.terminal.scrollBar
source: Show Terminal Scroll Bar
ja: ターミナルのスクロールバーを表示

# settings.terminal.scrollBar.subtitleOff
source: Hides the right-edge terminal scroll bar everywhere. Changes apply immediately and persist across relaunches.
ja: 右端のターミナルスクロールバーを全体で非表示にします。変更はすぐに反映され、再起動後も保持されます。

# settings.terminal.scrollBar.subtitleOn
source: Shows the right-edge terminal scroll bar in shell scrollback. UniConnect hides it automatically for alternate-screen style TUI surfaces.
ja: シェルのスクロールバックでは右端のターミナルスクロールバーを表示します。UniConnect は代替画面系の TUI では自動的に隠します。

# settings.terminal.agentAutoResume
source: Resume Agent Sessions on Reopen
ja: 再起動時にエージェントセッションを再開

# settings.terminal.agentAutoResume.subtitleOff
source: When UniConnect reopens after quit, restored agent terminals stay idle until you resume them manually.
ja: UniConnect を終了後に再度開いたとき、復元されたエージェント端末は手動で再開するまで待機します。

# settings.terminal.agentAutoResume.subtitleOn
source: When UniConnect reopens after quit, restored agent terminals automatically run their resume command.
ja: UniConnect を終了後に再度開いたとき、復元されたエージェント端末で再開コマンドを自動実行します。

# settings.terminal.agentHibernation
source: Agent Hibernation
ja: エージェント休止

# settings.terminal.agentHibernation.subtitleOff
source: Agent terminals stay live until you close them or quit UniConnect.
ja: エージェント端末は、閉じるか UniConnect を終了するまでライブのままです。

# settings.terminal.agentHibernation.subtitleOn
source: Idle background agent terminals can be hibernated when the live-terminal limit is exceeded.
ja: ライブ端末数の上限を超えると、アイドル状態のバックグラウンドエージェント端末を休止できます。

# settings.terminal.agentHibernation.idleSeconds
source: Hibernate After Idle Seconds
ja: 休止までのアイドル秒数

# settings.terminal.agentHibernation.idleSeconds.subtitle
source: A terminal must have no output and report an idle agent lifecycle for this long before it can be hibernated.
ja: この時間だけ出力がなく、エージェントのライフサイクルがアイドルと報告された端末だけを休止できます。

# settings.terminal.agentHibernation.maxLiveTerminals
source: Max Live Agent Terminals
ja: ライブエージェント端末の上限

# settings.terminal.agentHibernation.maxLiveTerminals.subtitle
source: Visible terminals stay live. Extra idle background agent terminals hibernate oldest first.
ja: 表示中の端末はライブのままです。余分なアイドル中のバックグラウンドエージェント端末は古い順に休止します。

# terminal.agentHibernation.title
source: Agent hibernated
ja: エージェントは休止中

# terminal.agentHibernation.lastActivity
source: Last activity %@
ja: 最終アクティビティ %@

# terminal.agentHibernation.resume
source: Resume
ja: 再開

# surfaceResumeApproval.cwd.none
source: None
ja: なし

# surfaceResumeApproval.proposal.ask
source: Ask Each Time
ja: 毎回確認

# surfaceResumeApproval.proposal.auto
source: Auto-Restore
ja: 自動復元

# surfaceResumeApproval.proposal.manual
source: Keep Manual
ja: 手動で保持

# surfaceResumeApproval.proposal.message
source: A process wants UniConnect to keep this resume command for the current terminal: %@ Working directory: %@
ja: プロセスが現在のターミナルにこの復元コマンドを保持しようとしています: %@ 作業ディレクトリ: %@

# surfaceResumeApproval.proposal.title
source: Allow Resume Command?
ja: 復元コマンドを許可しますか?

# surfaceResumeApproval.runPrompt.message
source: UniConnect is restoring a terminal with this resume command: %@ Working directory: %@
ja: UniConnect はこの復元コマンドでターミナルを復元しようとしています: %@ 作業ディレクトリ: %@

# surfaceResumeApproval.runPrompt.run
source: Run
ja: 実行

# surfaceResumeApproval.runPrompt.skip
source: Skip
ja: スキップ

# surfaceResumeApproval.runPrompt.title
source: Run Resume Command?
ja: 復元コマンドを実行しますか?

# settings.terminal.resumeCommands
source: Resume Commands
ja: 復元コマンド

# settings.terminal.resumeCommands.cwdSummary
source: Prefix: %@, cwd: %@
ja: プレフィックス: %@、cwd: %@

# settings.terminal.resumeCommands.delete
source: Delete
ja: 削除

# settings.terminal.resumeCommands.deleteFailed
source: Could not delete the resume command approval.
ja: 復元コマンドの承認を削除できませんでした。

# settings.terminal.resumeCommands.deleted
source: Resume command approval deleted.
ja: 復元コマンドの承認を削除しました。

# settings.terminal.resumeCommands.empty
source: No custom resume commands have been approved.
ja: 承認済みのカスタム復元コマンドはありません。

# settings.terminal.resumeCommands.envSummary
source: env: %@
ja: 環境変数: %@

# settings.terminal.resumeCommands.invalidPrefix
source: Enter a valid shell-style command prefix.
ja: 有効なシェル形式のコマンドプレフィックスを入力してください。

# settings.terminal.resumeCommands.invalidSignature
source: Signature does not match. Delete this approval and approve the command again.
ja: 署名が一致しません。この承認を削除してから、コマンドを再度承認してください。

# settings.terminal.resumeCommands.policy.auto
source: Auto
ja: 自動

# settings.terminal.resumeCommands.policy.manual
source: Manual
ja: 手動

# settings.terminal.resumeCommands.policy.prompt
source: Ask
ja: 確認

# settings.terminal.resumeCommands.prefixPlaceholder
source: Command prefix
ja: コマンドプレフィックス

# settings.terminal.resumeCommands.prefixSummary
source: Prefix: %@
ja: プレフィックス: %@

# settings.terminal.resumeCommands.save
source: Save
ja: 保存

# settings.terminal.resumeCommands.sourceUnknown
source: Unknown source
ja: 不明なソース

# settings.terminal.resumeCommands.subtitle
source: Review signed command prefixes that can restore non-agent terminal surfaces.
ja: 非エージェントのターミナルサーフェスを復元できる署名済みコマンドプレフィックスを確認します。

# settings.terminal.resumeCommands.updateFailed
source: Could not update the resume command approval.
ja: 復元コマンドの承認を更新できませんでした。

# settings.terminal.resumeCommands.updated
source: Resume command approval updated.
ja: 復元コマンドの承認を更新しました。
